#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "rus");
    cout << "Розмір = 5 : "; // Вивід повідомлення
    const int n = 5; // Оголошення змінної для розміру масиву
    int arr[n]; // Оголошення масиву
    for (int i = 0; i < n; i++) { // Цикл для введення елементів масиву
        cout << "Введіть елемент " << i + 1 << ": "; // Вивід повідомлення
        cin >> arr[i]; // Введення елемента масиву
    }


    for (int i = 0; i < n; i++) {//цикл для визначення і обнулення парних елементів
        if (arr[i] % 2 == 0) {
            arr[i] = 0;
        }
    }


    cout << "Масив після обнулення парних елементів: ";
    for (int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    return 0;
}
