#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "rus");
    cout << "Розмір = 5 : "; // Вивід повідомлення
    const int n = 5; // Оголошення змінної для розміру масиву
    int arr[n]; // Оголошення масиву
    for (int i = 0; i < n; i++) { // Цикл для введення елементів масиву
        cout << "Введіть елемент " << i + 1 << ": "; // Вивід повідомлення
        cin >> arr[i]; // Введення елемента масиву
    }


    cout << "Елементи масиву в зворотньому порядку: ";
    for (int i = n - 1; i >= 0; i--) {//цикл для знаходження елементів масиву в зворотньому порядку
        cout << arr[i] << " ";
    }
    cout << endl;

    return 0;
}